[NoCoverage] PublicVisibility
Controller/PaymentController.php:15:5
 
 class PaymentController extends AbstractController
 {
-    #[Route('/calculate-price', methods: ['POST'])]
+    protected function calculatePrice(PriceCalculationRequest $request, PriceCalculatorService $service)
     public function calculatePrice(
         PriceCalculationRequest $request,

[NoCoverage] NewObject
Controller/PaymentController.php:20:9
         PriceCalculationRequest $request,
         PriceCalculatorService $service
     ) {
-        return new JsonResponse(['price' => $service->calculatePrice($request->productId, $request->taxNumber, $request->couponCode)]);
+        new JsonResponse(['price' => $service->calculatePrice($request->productId, $request->taxNumber, $request->couponCode)]);
+        return null;
     }
 

[NoCoverage] ArrayItemRemoval
Controller/PaymentController.php:20:9
         PriceCalculationRequest $request,
         PriceCalculatorService $service
     ) {
-        return new JsonResponse(['price' => $service->calculatePrice($request->productId, $request->taxNumber, $request->couponCode)]);
+        return new JsonResponse([]);
     }
 

[NoCoverage] PublicVisibility
Controller/PaymentController.php:23:5
         return new JsonResponse(['price' => $service->calculatePrice($request->productId, $request->taxNumber, $request->couponCode)]);
     }
 
-    #[Route('/purchase', methods: ['POST'])]
+    protected function purchase(PurchaseRequest $request, PriceCalculatorService $calculatorService, PurchaseService $purchaseService)
     public function purchase(
         PurchaseRequest $request,

[NoCoverage] NewObject
Controller/PaymentController.php:31:9
     ) {
         $price = $calculatorService->calculatePrice($request->productId, $request->taxNumber, $request->couponCode);
         $result = $purchaseService->purchase($price,$request->paymentProcessor);
-        return new JsonResponse(['result' => $result]);
+        new JsonResponse(['result' => $result]);
+        return null;
     }
 }

[NoCoverage] ArrayItemRemoval
Controller/PaymentController.php:31:9
     ) {
         $price = $calculatorService->calculatePrice($request->productId, $request->taxNumber, $request->couponCode);
         $result = $purchaseService->purchase($price,$request->paymentProcessor);
-        return new JsonResponse(['result' => $result]);
+        return new JsonResponse([]);
     }
 }
