[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:16:9
     {
         // Продукты
         $iphone = new Product();
-        $iphone->setName('Iphone')->setPrice(100.00);
+        
         $manager->persist($iphone);
 

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:17:9
         // Продукты
         $iphone = new Product();
         $iphone->setName('Iphone')->setPrice(100.00);
-        $manager->persist($iphone);
+        
 
         $headphones = new Product();

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:20:9
         $manager->persist($iphone);
 
         $headphones = new Product();
-        $headphones->setName('Наушники')->setPrice(20.00);
+        
         $manager->persist($headphones);
 

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:21:9
 
         $headphones = new Product();
         $headphones->setName('Наушники')->setPrice(20.00);
-        $manager->persist($headphones);
+        
 
         $case = new Product();

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:24:9
         $manager->persist($headphones);
 
         $case = new Product();
-        $case->setName('Чехол')->setPrice(10.00);
+        
         $manager->persist($case);
 

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:25:9
 
         $case = new Product();
         $case->setName('Чехол')->setPrice(10.00);
-        $manager->persist($case);
+        
 
         // Купоны

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:29:9
 
         // Купоны
         $couponD15 = new Coupon();
-        $couponD15->setCode('D15')->setType('percent')->setValue(15.00);
+        
         $manager->persist($couponD15);
 

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:30:9
         // Купоны
         $couponD15 = new Coupon();
         $couponD15->setCode('D15')->setType('percent')->setValue(15.00);
-        $manager->persist($couponD15);
+        
 
         $couponP10 = new Coupon();

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:33:9
         $manager->persist($couponD15);
 
         $couponP10 = new Coupon();
-        $couponP10->setCode('P10')->setType('percent')->setValue(10.00);
+        
         $manager->persist($couponP10);
 

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:34:9
 
         $couponP10 = new Coupon();
         $couponP10->setCode('P10')->setType('percent')->setValue(10.00);
-        $manager->persist($couponP10);
+        
 
         $couponF5 = new Coupon();

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:37:9
         $manager->persist($couponP10);
 
         $couponF5 = new Coupon();
-        $couponF5->setCode('F5')->setType('fixed')->setValue(5.00);
+        
         $manager->persist($couponF5);
 

[NoCoverage] MethodCallRemoval
DataFixtures/AppFixtures.php:38:9
 
         $couponF5 = new Coupon();
         $couponF5->setCode('F5')->setType('fixed')->setValue(5.00);
-        $manager->persist($couponF5);
+        
 
         $manager->flush();
