[NoCoverage] PublicVisibility
Entity/Coupon.php:31:5
         return $this->id;
     }
 
-    public function getCode(): string
+    protected function getCode(): string
     {
         return $this->code;

[NoCoverage] PublicVisibility
Entity/Coupon.php:36:5
         return $this->code;
     }
 
-    public function setCode(string $code): self
+    protected function setCode(string $code): self
     {
         $this->code = $code;

[Killed] PublicVisibility
Entity/Coupon.php:47:5
         return $this->type;
     }
 
-    public function setType(string $type): self
+    protected function setType(string $type): self
     {
         $this->type = $type;
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithPercentCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithPercentCoupon
Error: Call to protected method App\Entity\Coupon::setType() from scope App\Tests\Unit\PriceCalculatorTest

/var/www/html/tests/Unit/PriceCalculatorTest.php:49

ERRORS!
Tests: 2, Assertions: 3, Errors: 1.

[Killed] PublicVisibility
Entity/Coupon.php:53:5
         return $this;
     }
 
-    public function getValue(): float
+    protected function getValue(): float
     {
         return (float) $this->value;
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithPercentCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithPercentCoupon
Error: Call to protected method App\Entity\Coupon::getValue() from scope App\Services\PriceCalculatorService

/var/www/html/src/Services/PriceCalculatorService.php:39
/var/www/html/src/Services/PriceCalculatorService.php:29
/var/www/html/tests/Unit/PriceCalculatorTest.php:55

ERRORS!

[Survived] CastFloat
Entity/Coupon.php:55:9
 
     public function getValue(): float
     {
-        return (float) $this->value;
+        return $this->value;
     }
 

[Killed] PublicVisibility
Entity/Coupon.php:58:5
         return (float) $this->value;
     }
 
-    public function setValue(float $value): self
+    protected function setValue(float $value): self
     {
         $this->value = (string) $value;
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithPercentCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithPercentCoupon
Error: Call to protected method App\Entity\Coupon::setValue() from scope App\Tests\Unit\PriceCalculatorTest

/var/www/html/tests/Unit/PriceCalculatorTest.php:49

ERRORS!
Tests: 2, Assertions: 3, Errors: 1.

[Survived] CastString
Entity/Coupon.php:60:9
 
     public function setValue(float $value): self
     {
-        $this->value = (string) $value;
+        $this->value = $value;
         return $this;
     }
