[NoCoverage] PublicVisibility
Entity/Product.php:33:5
         return $this->name;
     }
 
-    public function setName(string $name): self
+    protected function setName(string $name): self
     {
         $this->name = $name;

[Survived] CastFloat
Entity/Product.php:41:9
 
     public function getPrice(): float
     {
-        return (float) $this->price;
+        return $this->price;
     }
 

[Killed] PublicVisibility
Entity/Product.php:44:5
         return (float) $this->price;
     }
 
-    public function setPrice(float $price): self
+    protected function setPrice(float $price): self
     {
         $this->price = (string) $price;
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
Error: Call to protected method App\Entity\Product::setPrice() from scope App\Tests\Unit\PriceCalculatorTest

/var/www/html/tests/Unit/PriceCalculatorTest.php:29

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.
