[NoCoverage] DecrementInteger
Exceptions/BaseHttpException.php:9:5
 
 class BaseHttpException extends HttpException
 {
-    public function __construct(string $message = '', int $statusCode = 400, \Throwable $previous = null, array $headers = [], int $code = 0)
+    public function __construct(string $message = '', int $statusCode = 399, \Throwable $previous = null, array $headers = [], int $code = 0)
     {
         parent::__construct($statusCode, $message, $previous, $headers, $code);

[NoCoverage] IncrementInteger
Exceptions/BaseHttpException.php:9:5
 
 class BaseHttpException extends HttpException
 {
-    public function __construct(string $message = '', int $statusCode = 400, \Throwable $previous = null, array $headers = [], int $code = 0)
+    public function __construct(string $message = '', int $statusCode = 400, \Throwable $previous = null, array $headers = [], int $code = 1)
     {
         parent::__construct($statusCode, $message, $previous, $headers, $code);

[NoCoverage] MethodCallRemoval
Exceptions/BaseHttpException.php:11:9
 {
     public function __construct(string $message = '', int $statusCode = 400, \Throwable $previous = null, array $headers = [], int $code = 0)
     {
-        parent::__construct($statusCode, $message, $previous, $headers, $code);
+        
     }
 }
