[NoCoverage] DecrementInteger
Exceptions/CouponNotFoundException.php:9:9
 {
     public function __construct(string $message = 'Invalid coupon code')
     {
-        parent::__construct($message, 404);
+        parent::__construct($message, 403);
     }
 }

[NoCoverage] MethodCallRemoval
Exceptions/CouponNotFoundException.php:9:9
 {
     public function __construct(string $message = 'Invalid coupon code')
     {
-        parent::__construct($message, 404);
+        
     }
 }
