[NoCoverage] MethodCallRemoval
Exceptions/InvalidDtoArguments.php:14:9
     public function __construct(?array $errors = null, string $message = 'Bad request')
     {
         $this->errors = $errors;
-        parent::__construct($message,400);
+        
     }
 

[NoCoverage] DecrementInteger
Exceptions/InvalidDtoArguments.php:14:9
     public function __construct(?array $errors = null, string $message = 'Bad request')
     {
         $this->errors = $errors;
-        parent::__construct($message,400);
+        parent::__construct($message, 399);
     }
 

[NoCoverage] PublicVisibility
Exceptions/InvalidDtoArguments.php:17:5
         parent::__construct($message,400);
     }
 
-    public function getErrors(): array
+    protected function getErrors(): array
     {
         return $this->errors;
