[NoCoverage] IncrementInteger
Exceptions/ProductNotFoundException.php:9:9
 {
     public function __construct(string $message = 'Product not found')
     {
-        parent::__construct($message, 404);
+        parent::__construct($message, 405);
     }
 }
