[NoCoverage] PublicVisibility
Listners/JsonExceptionListener.php:12:5
 
 class JsonExceptionListener
 {
-    public function onKernelException(ExceptionEvent $event)
+    protected function onKernelException(ExceptionEvent $event)
     {
         $exception = $event->getThrowable();

[NoCoverage] InstanceOf_
Listners/JsonExceptionListener.php:15:9
     public function onKernelException(ExceptionEvent $event)
     {
         $exception = $event->getThrowable();
-        if ($exception instanceof InvalidDtoArguments) {
+        if (false) {
             $response = new JsonResponse();
             if (!empty($exception->getErrors())) {

[NoCoverage] InstanceOf_
Listners/JsonExceptionListener.php:15:9
     public function onKernelException(ExceptionEvent $event)
     {
         $exception = $event->getThrowable();
-        if ($exception instanceof InvalidDtoArguments) {
+        if (true) {
             $response = new JsonResponse();
             if (!empty($exception->getErrors())) {

[NoCoverage] LogicalNot
Listners/JsonExceptionListener.php:17:13
         $exception = $event->getThrowable();
         if ($exception instanceof InvalidDtoArguments) {
             $response = new JsonResponse();
-            if (!empty($exception->getErrors())) {
+            if (empty($exception->getErrors())) {
                 $response->setData(['errors' => $exception->getErrors()]);
             } else {

[NoCoverage] MethodCallRemoval
Listners/JsonExceptionListener.php:18:17
         if ($exception instanceof InvalidDtoArguments) {
             $response = new JsonResponse();
             if (!empty($exception->getErrors())) {
-                $response->setData(['errors' => $exception->getErrors()]);
+                
             } else {
                 $response->setData(['error' => $exception->getMessage()]);

[NoCoverage] ArrayItem
Listners/JsonExceptionListener.php:18:17
         if ($exception instanceof InvalidDtoArguments) {
             $response = new JsonResponse();
             if (!empty($exception->getErrors())) {
-                $response->setData(['errors' => $exception->getErrors()]);
+                $response->setData(['errors' > $exception->getErrors()]);
             } else {
                 $response->setData(['error' => $exception->getMessage()]);

[NoCoverage] MethodCallRemoval
Listners/JsonExceptionListener.php:20:17
             if (!empty($exception->getErrors())) {
                 $response->setData(['errors' => $exception->getErrors()]);
             } else {
-                $response->setData(['error' => $exception->getMessage()]);
+                
             }
             $response->setStatusCode(400);

[NoCoverage] ArrayItemRemoval
Listners/JsonExceptionListener.php:20:17
             if (!empty($exception->getErrors())) {
                 $response->setData(['errors' => $exception->getErrors()]);
             } else {
-                $response->setData(['error' => $exception->getMessage()]);
+                $response->setData([]);
             }
             $response->setStatusCode(400);

[NoCoverage] IncrementInteger
Listners/JsonExceptionListener.php:22:13
             } else {
                 $response->setData(['error' => $exception->getMessage()]);
             }
-            $response->setStatusCode(400);
+            $response->setStatusCode(401);
             $event->setResponse($response);
         } else {

[NoCoverage] MethodCallRemoval
Listners/JsonExceptionListener.php:22:13
             } else {
                 $response->setData(['error' => $exception->getMessage()]);
             }
-            $response->setStatusCode(400);
+            
             $event->setResponse($response);
         } else {

[NoCoverage] MethodCallRemoval
Listners/JsonExceptionListener.php:23:13
                 $response->setData(['error' => $exception->getMessage()]);
             }
             $response->setStatusCode(400);
-            $event->setResponse($response);
+            
         } else {
             $statusCode = $exception instanceof HttpExceptionInterface

[NoCoverage] InstanceOf_
Listners/JsonExceptionListener.php:25:13
             $response->setStatusCode(400);
             $event->setResponse($response);
         } else {
-            $statusCode = $exception instanceof HttpExceptionInterface
+            $statusCode = true ? $exception->getStatusCode() : 500;
                 ? $exception->getStatusCode()
                 : 500;

[NoCoverage] Ternary
Listners/JsonExceptionListener.php:25:13
             $response->setStatusCode(400);
             $event->setResponse($response);
         } else {
-            $statusCode = $exception instanceof HttpExceptionInterface
-                ? $exception->getStatusCode()
-                : 500;
+            $statusCode = $exception instanceof HttpExceptionInterface ? 500 : $exception->getStatusCode();
             $errorMessage = $exception->getMessage();
             $response = new JsonResponse(

[NoCoverage] IncrementInteger
Listners/JsonExceptionListener.php:27:17
         } else {
             $statusCode = $exception instanceof HttpExceptionInterface
                 ? $exception->getStatusCode()
-                : 500;
+                $statusCode = $exception instanceof HttpExceptionInterface ? $exception->getStatusCode() : 501;
             $errorMessage = $exception->getMessage();
             $response = new JsonResponse(

[NoCoverage] DecrementInteger
Listners/JsonExceptionListener.php:27:17
         } else {
             $statusCode = $exception instanceof HttpExceptionInterface
                 ? $exception->getStatusCode()
-                : 500;
+                $statusCode = $exception instanceof HttpExceptionInterface ? $exception->getStatusCode() : 499;
             $errorMessage = $exception->getMessage();
             $response = new JsonResponse(

[NoCoverage] MethodCallRemoval
Listners/JsonExceptionListener.php:37:9
                 $statusCode
             );
         }
-        $response->headers->set('Content-Type', 'application/json');
+        
         $event->setResponse($response);
     }

[NoCoverage] MethodCallRemoval
Listners/JsonExceptionListener.php:38:9
             );
         }
         $response->headers->set('Content-Type', 'application/json');
-        $event->setResponse($response);
+        
     }
 }
