[NoCoverage] PublicVisibility
Listners/JsonRequestTransformerListener.php:14:5
 
 class JsonRequestTransformerListener
 {
-    public function onKernelRequest(RequestEvent $event)
+    protected function onKernelRequest(RequestEvent $event)
     {
         $request = $event->getRequest();

[NoCoverage] LogicalNot
Listners/JsonRequestTransformerListener.php:22:9
             return;
         }
         $response = new JsonResponse();
-        if (!$this->isJsonRequest($request)) {
+        if ($this->isJsonRequest($request)) {
             $response = $response->setData(['error' => 'Only JSON requests are allowed.']);
             $response->setStatusCode(Response::HTTP_UNSUPPORTED_MEDIA_TYPE);

[NoCoverage] MethodCallRemoval
Listners/JsonRequestTransformerListener.php:24:13
         $response = new JsonResponse();
         if (!$this->isJsonRequest($request)) {
             $response = $response->setData(['error' => 'Only JSON requests are allowed.']);
-            $response->setStatusCode(Response::HTTP_UNSUPPORTED_MEDIA_TYPE);
+            
             $event->setResponse($response);
             return;

[NoCoverage] MethodCallRemoval
Listners/JsonRequestTransformerListener.php:25:13
         if (!$this->isJsonRequest($request)) {
             $response = $response->setData(['error' => 'Only JSON requests are allowed.']);
             $response->setStatusCode(Response::HTTP_UNSUPPORTED_MEDIA_TYPE);
-            $event->setResponse($response);
+            
             return;
         }

[NoCoverage] LogicalNot
Listners/JsonRequestTransformerListener.php:28:9
             $event->setResponse($response);
             return;
         }
-        if (!$this->transformJsonBody($request)) {
+        if ($this->transformJsonBody($request)) {
             $response = $response->setData(['error' => 'Unable to parse request.']);
             $response->setStatusCode(Response::HTTP_BAD_REQUEST);

[NoCoverage] ArrayItemRemoval
Listners/JsonRequestTransformerListener.php:29:13
             return;
         }
         if (!$this->transformJsonBody($request)) {
-            $response = $response->setData(['error' => 'Unable to parse request.']);
+            $response = $response->setData([]);
             $response->setStatusCode(Response::HTTP_BAD_REQUEST);
             $event->setResponse($response);

[NoCoverage] MethodCallRemoval
Listners/JsonRequestTransformerListener.php:30:13
         }
         if (!$this->transformJsonBody($request)) {
             $response = $response->setData(['error' => 'Unable to parse request.']);
-            $response->setStatusCode(Response::HTTP_BAD_REQUEST);
+            
             $event->setResponse($response);
         }

[NoCoverage] MethodCallRemoval
Listners/JsonRequestTransformerListener.php:31:13
         if (!$this->transformJsonBody($request)) {
             $response = $response->setData(['error' => 'Unable to parse request.']);
             $response->setStatusCode(Response::HTTP_BAD_REQUEST);
-            $event->setResponse($response);
+            
         }
     }

[NoCoverage] Identical
Listners/JsonRequestTransformerListener.php:37:9
 
     private function isJsonRequest(Request $request)
     {
-        return 'json' === $request->getContentTypeFormat();
+        return 'json' !== $request->getContentTypeFormat();
     }
 

[NoCoverage] NotIdentical
Listners/JsonRequestTransformerListener.php:43:9
     private function transformJsonBody(Request $request)
     {
         $data = json_decode($request->getContent(), true);
-        if (json_last_error() !== JSON_ERROR_NONE) {
+        if (json_last_error() === JSON_ERROR_NONE) {
             return false;
         }

[NoCoverage] FalseValue
Listners/JsonRequestTransformerListener.php:44:13
     {
         $data = json_decode($request->getContent(), true);
         if (json_last_error() !== JSON_ERROR_NONE) {
-            return false;
+            return true;
         }
         if ($data === null) {

[NoCoverage] Identical
Listners/JsonRequestTransformerListener.php:46:9
         if (json_last_error() !== JSON_ERROR_NONE) {
             return false;
         }
-        if ($data === null) {
+        if ($data !== null) {
             return true;
         }

[NoCoverage] TrueValue
Listners/JsonRequestTransformerListener.php:47:13
             return false;
         }
         if ($data === null) {
-            return true;
+            return false;
         }
         $request->request->replace($data);

[NoCoverage] MethodCallRemoval
Listners/JsonRequestTransformerListener.php:49:9
         if ($data === null) {
             return true;
         }
-        $request->request->replace($data);
+        
         return true;
     }

[NoCoverage] TrueValue
Listners/JsonRequestTransformerListener.php:50:9
             return true;
         }
         $request->request->replace($data);
-        return true;
+        return false;
     }
 }
