[NoCoverage] PublicVisibility
Listners/JsonResponseTransformerListener.php:10:5
 
 class JsonResponseTransformerListener
 {
-    public function onKernelResponse(ResponseEvent $event)
+    protected function onKernelResponse(ResponseEvent $event)
     {
         $response = $event->getResponse();

[NoCoverage] LogicalNot
Listners/JsonResponseTransformerListener.php:13:9
     public function onKernelResponse(ResponseEvent $event)
     {
         $response = $event->getResponse();
-        if (!$event->isMainRequest()) {
+        if ($event->isMainRequest()) {
             return;
         }

[NoCoverage] IfNegation
Listners/JsonResponseTransformerListener.php:17:9
             return;
         }
         $content = $response->getContent();
-        if ($this->isJson($content)) {
-            return;
-        }
+        if (!$this->isJson($content)) {
         $jsonContent = json_encode([
             'status' => $response->getStatusCode(),

[NoCoverage] ArrayItem
Listners/JsonResponseTransformerListener.php:21:13
             return;
         }
         $jsonContent = json_encode([
-            'status' => $response->getStatusCode(),
+            $jsonContent = json_encode(['status' > $response->getStatusCode(), 'data' => $content]);
             'data' => $content,
         ]);

[NoCoverage] IfNegation
Listners/JsonResponseTransformerListener.php:24:9
             'status' => $response->getStatusCode(),
             'data' => $content,
         ]);
-        if ($jsonContent) {
-            $newResponse = new Response(
-                $jsonContent,
-                $response->getStatusCode(),
-                ['Content-Type' => 'application/json']
-            );
-            $event->setResponse($newResponse);
-        }
+        if (!$jsonContent) {
     }
 

[NoCoverage] ArrayItemRemoval
Listners/JsonResponseTransformerListener.php:28:17
             $newResponse = new Response(
                 $jsonContent,
                 $response->getStatusCode(),
-                ['Content-Type' => 'application/json']
+                $newResponse = new Response($jsonContent, $response->getStatusCode(), []);
             );
             $event->setResponse($newResponse);

[NoCoverage] MethodCallRemoval
Listners/JsonResponseTransformerListener.php:30:13
                 $response->getStatusCode(),
                 ['Content-Type' => 'application/json']
             );
-            $event->setResponse($newResponse);
+            
         }
     }

[NoCoverage] FalseValue
Listners/JsonResponseTransformerListener.php:37:13
     private function isJson(string $string): bool
     {
         if (empty($string)) {
-            return false;
+            return true;
         }
         json_decode($string);

[NoCoverage] FunctionCallRemoval
Listners/JsonResponseTransformerListener.php:39:9
         if (empty($string)) {
             return false;
         }
-        json_decode($string);
+        
         return json_last_error() === JSON_ERROR_NONE;
     }
