[NoCoverage] MethodCallRemoval
Repository/CouponRepository.php:19:9
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, Coupon::class);
+        
     }
 

[NoCoverage] ArrayItemRemoval
Repository/CouponRepository.php:27:9
         /**
          * @var Coupon $coupon
          */
-        $coupon = $this->findOneBy(['code' => $code]);
+        $coupon = $this->findOneBy([]);
         if (!$coupon) {
             throw new CouponNotFoundException();

[NoCoverage] LogicalNot
Repository/CouponRepository.php:28:9
          * @var Coupon $coupon
          */
         $coupon = $this->findOneBy(['code' => $code]);
-        if (!$coupon) {
+        if ($coupon) {
             throw new CouponNotFoundException();
         }

[NoCoverage] Throw_
Repository/CouponRepository.php:29:13
          */
         $coupon = $this->findOneBy(['code' => $code]);
         if (!$coupon) {
-            throw new CouponNotFoundException();
+            new CouponNotFoundException();
         }
         return $coupon;
