[NoCoverage] MethodCallRemoval
Repository/ProductRepository.php:18:9
 {
     public function __construct(ManagerRegistry $registry)
     {
-        parent::__construct($registry, Product::class);
+        
     }
 

[NoCoverage] LogicalNot
Repository/ProductRepository.php:24:9
     public function findById(int $id): Product
     {
         $product = $this->find($id);
-        if (!$product) {
+        if ($product) {
             throw new ProductNotFoundException();
         }

[NoCoverage] Throw_
Repository/ProductRepository.php:25:13
     {
         $product = $this->find($id);
         if (!$product) {
-            throw new ProductNotFoundException();
+            new ProductNotFoundException();
         }
         return $product;
