[NoCoverage] Identical
Resolvers/DTOResolver.php:24:9
     public function resolve(Request $request, ArgumentMetadata $argument): iterable
     {
         $type = $argument->getType();
-        if ($type === null || !is_a($type, RequestDTO::class, true)) {
+        if ($type !== null || !is_a($type, RequestDTO::class, true)) {
             return [];
         }

[NoCoverage] LogicalOrAllSubExprNegation
Resolvers/DTOResolver.php:24:9
     public function resolve(Request $request, ArgumentMetadata $argument): iterable
     {
         $type = $argument->getType();
-        if ($type === null || !is_a($type, RequestDTO::class, true)) {
+        if (!($type === null) || is_a($type, RequestDTO::class, true)) {
             return [];
         }

[NoCoverage] Catch_
Resolvers/DTOResolver.php:33:13
         } else {
             try {
                 $dto = $this->serializer->deserialize($data, $type, 'json');
-            } catch (NotEncodableValueException|NotNormalizableValueException $e) {
-                throw new InvalidDtoArguments([]);
-            }
+            } catch (NotEncodableValueException $e) {
         }
         $violations = $this->validator->validate($dto);

[NoCoverage] Catch_
Resolvers/DTOResolver.php:33:13
         } else {
             try {
                 $dto = $this->serializer->deserialize($data, $type, 'json');
-            } catch (NotEncodableValueException|NotNormalizableValueException $e) {
-                throw new InvalidDtoArguments([]);
-            }
+            } catch (NotNormalizableValueException $e) {
         }
         $violations = $this->validator->validate($dto);

[NoCoverage] Throw_
Resolvers/DTOResolver.php:34:17
             try {
                 $dto = $this->serializer->deserialize($data, $type, 'json');
             } catch (NotEncodableValueException|NotNormalizableValueException $e) {
-                throw new InvalidDtoArguments([]);
+                new InvalidDtoArguments([]);
             }
         }

[NoCoverage] GreaterThanNegotiation
Resolvers/DTOResolver.php:38:9
             }
         }
         $violations = $this->validator->validate($dto);
-        if (count($violations) > 0) {
+        if (count($violations) <= 0) {
             $errors = [];
             foreach ($violations as $violation) {

[NoCoverage] GreaterThan
Resolvers/DTOResolver.php:38:9
             }
         }
         $violations = $this->validator->validate($dto);
-        if (count($violations) > 0) {
+        if (count($violations) >= 0) {
             $errors = [];
             foreach ($violations as $violation) {

[NoCoverage] Foreach_
Resolvers/DTOResolver.php:40:13
         $violations = $this->validator->validate($dto);
         if (count($violations) > 0) {
             $errors = [];
-            foreach ($violations as $violation) {
-                $errors[$violation->getPropertyPath()] = $violation->getMessage();
-            }
+            foreach ([] as $violation) {
             throw new InvalidDtoArguments($errors);
         }

[NoCoverage] Throw_
Resolvers/DTOResolver.php:43:13
             foreach ($violations as $violation) {
                 $errors[$violation->getPropertyPath()] = $violation->getMessage();
             }
-            throw new InvalidDtoArguments($errors);
+            new InvalidDtoArguments($errors);
         }
         yield $dto;
