[NoCoverage] PublicVisibility
Services/Payment/PaymentProcessorFactory.php:11:5
     {
     }
 
-    public function create(string $processorName): PaymentProcessorInterface
+    protected function create(string $processorName): PaymentProcessorInterface
     {
         if (!isset($this->processors[$processorName])) {

[NoCoverage] LogicalNot
Services/Payment/PaymentProcessorFactory.php:13:9
 
     public function create(string $processorName): PaymentProcessorInterface
     {
-        if (!isset($this->processors[$processorName])) {
+        if (isset($this->processors[$processorName])) {
             throw new \InvalidArgumentException(sprintf('Payment processor "%s" is not supported.', $processorName));
         }

[NoCoverage] Throw_
Services/Payment/PaymentProcessorFactory.php:14:13
     public function create(string $processorName): PaymentProcessorInterface
     {
         if (!isset($this->processors[$processorName])) {
-            throw new \InvalidArgumentException(sprintf('Payment processor "%s" is not supported.', $processorName));
+            new \InvalidArgumentException(sprintf('Payment processor "%s" is not supported.', $processorName));
         }
         if (!$this->processors[$processorName] instanceof PaymentProcessorInterface) {

[NoCoverage] LogicalNot
Services/Payment/PaymentProcessorFactory.php:16:9
         if (!isset($this->processors[$processorName])) {
             throw new \InvalidArgumentException(sprintf('Payment processor "%s" is not supported.', $processorName));
         }
-        if (!$this->processors[$processorName] instanceof PaymentProcessorInterface) {
+        if ($this->processors[$processorName] instanceof PaymentProcessorInterface) {
             throw new \LogicException(sprintf('Service "%s" must implement PaymentProcessorInterface.', $processorName));
         }

[NoCoverage] InstanceOf_
Services/Payment/PaymentProcessorFactory.php:16:9
         if (!isset($this->processors[$processorName])) {
             throw new \InvalidArgumentException(sprintf('Payment processor "%s" is not supported.', $processorName));
         }
-        if (!$this->processors[$processorName] instanceof PaymentProcessorInterface) {
+        if (!false) {
             throw new \LogicException(sprintf('Service "%s" must implement PaymentProcessorInterface.', $processorName));
         }

[NoCoverage] Throw_
Services/Payment/PaymentProcessorFactory.php:17:13
             throw new \InvalidArgumentException(sprintf('Payment processor "%s" is not supported.', $processorName));
         }
         if (!$this->processors[$processorName] instanceof PaymentProcessorInterface) {
-            throw new \LogicException(sprintf('Service "%s" must implement PaymentProcessorInterface.', $processorName));
+            new \LogicException(sprintf('Service "%s" must implement PaymentProcessorInterface.', $processorName));
         }
         return $this->processors[$processorName];

[NoCoverage] PublicVisibility
Services/Payment/PaymentProcessorFactory.php:22:5
         return $this->processors[$processorName];
     }
 
-    public function getSupportedProcessors(): array
+    protected function getSupportedProcessors(): array
     {
         return array_keys($this->processors);

[NoCoverage] UnwrapArrayKeys
Services/Payment/PaymentProcessorFactory.php:24:9
 
     public function getSupportedProcessors(): array
     {
-        return array_keys($this->processors);
+        return $this->processors;
     }
 }
