[NoCoverage] MethodCallRemoval
Services/Payment/PaypalAdapter.php:16:13
     public function process(float $amount): bool
     {
         try {
-            $this->processor->pay(intval($amount));
+            
             return true;
         } catch (\Exception $exception) {

[NoCoverage] TrueValue
Services/Payment/PaypalAdapter.php:17:13
     {
         try {
             $this->processor->pay(intval($amount));
-            return true;
+            return false;
         } catch (\Exception $exception) {
             // Логика если платеж не удался

[NoCoverage] FalseValue
Services/Payment/PaypalAdapter.php:20:13
             return true;
         } catch (\Exception $exception) {
             // Логика если платеж не удался
-            return false;
+            return true;
         }
     }
