[Killed] PublicVisibility
Services/PriceCalculatorService.php:23:5
     {
     }
 
-    public function calculatePrice(int $productId, string $taxNumber, ?string $couponCode = null): float
+    protected function calculatePrice(int $productId, string $taxNumber, ?string $couponCode = null): float
     {
         $product = $this->productRepository->findById($productId);
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
Error: Call to protected method App\Services\PriceCalculatorService::calculatePrice() from scope App\Tests\Unit\PriceCalculatorTest

/var/www/html/tests/Unit/PriceCalculatorTest.php:35

ERRORS!
Tests: 1, Assertions: 0, Errors: 1.

[Killed] IfNegation
Services/PriceCalculatorService.php:27:9
     {
         $product = $this->productRepository->findById($productId);
         $basePrice = $product->getPrice();
-        if ($couponCode) {
-            $coupon = $this->couponRepository->findByCode($couponCode);
-            $basePrice = $this->applyCoupon($basePrice, $coupon);
-        }
+        if (!$couponCode) {
         $countryCode = substr($taxNumber, 0, 2);
         $taxRate = $this->taxRates[$countryCode] ?? 0;
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
TypeError: MockObject_CouponRepositoryInterface_c1d7804f::findByCode(): Argument #1 ($code) must be of type string, null given, called in /var/www/html/src/Services/PriceCalculatorService.php on line 20

/var/www/html/src/Services/PriceCalculatorService.php:20
/var/www/html/tests/Unit/PriceCalculatorTest.php:35

ERRORS!
Tests:

[Killed] DecrementInteger
Services/PriceCalculatorService.php:31:9
             $coupon = $this->couponRepository->findByCode($couponCode);
             $basePrice = $this->applyCoupon($basePrice, $coupon);
         }
-        $countryCode = substr($taxNumber, 0, 2);
+        $countryCode = substr($taxNumber, 0, 1);
         $taxRate = $this->taxRates[$countryCode] ?? 0;
         return round($basePrice * (1 + $taxRate), 2);
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
Failed asserting that 100.0 matches expected 119.0.

/var/www/html/tests/Unit/PriceCalculatorTest.php:36

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Services/PriceCalculatorService.php:31:9
             $coupon = $this->couponRepository->findByCode($couponCode);
             $basePrice = $this->applyCoupon($basePrice, $coupon);
         }
-        $countryCode = substr($taxNumber, 0, 2);
+        $countryCode = substr($taxNumber, 1, 2);
         $taxRate = $this->taxRates[$countryCode] ?? 0;
         return round($basePrice * (1 + $taxRate), 2);
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
Failed asserting that 100.0 matches expected 119.0.

/var/www/html/tests/Unit/PriceCalculatorTest.php:36

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Services/PriceCalculatorService.php:32:9
             $basePrice = $this->applyCoupon($basePrice, $coupon);
         }
         $countryCode = substr($taxNumber, 0, 2);
-        $taxRate = $this->taxRates[$countryCode] ?? 0;
+        $taxRate = $this->taxRates[$countryCode] ?? -1;
         return round($basePrice * (1 + $taxRate), 2);
     }
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithInvalidCountryCode
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithInvalidCountryCode
Failed asserting that 0.0 matches expected 100.0.

/var/www/html/tests/Unit/PriceCalculatorTest.php:89

FAILURES!
Tests: 4, Assertions: 15, Failures: 1.

[Killed] IncrementInteger
Services/PriceCalculatorService.php:32:9
             $basePrice = $this->applyCoupon($basePrice, $coupon);
         }
         $countryCode = substr($taxNumber, 0, 2);
-        $taxRate = $this->taxRates[$countryCode] ?? 0;
+        $taxRate = $this->taxRates[$countryCode] ?? 1;
         return round($basePrice * (1 + $taxRate), 2);
     }
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithInvalidCountryCode
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithInvalidCountryCode
Failed asserting that 200.0 matches expected 100.0.

/var/www/html/tests/Unit/PriceCalculatorTest.php:89

FAILURES!
Tests: 4, Assertions: 15, Failures: 1.

[Killed] Multiplication
Services/PriceCalculatorService.php:33:9
         }
         $countryCode = substr($taxNumber, 0, 2);
         $taxRate = $this->taxRates[$countryCode] ?? 0;
-        return round($basePrice * (1 + $taxRate), 2);
+        return round($basePrice / (1 + $taxRate), 2);
     }
 
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
Failed asserting that 84.03 matches expected 119.0.

/var/www/html/tests/Unit/PriceCalculatorTest.php:36

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Services/PriceCalculatorService.php:33:9
         }
         $countryCode = substr($taxNumber, 0, 2);
         $taxRate = $this->taxRates[$countryCode] ?? 0;
-        return round($basePrice * (1 + $taxRate), 2);
+        return round($basePrice * (0 + $taxRate), 2);
     }
 
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithoutCoupon
Failed asserting that 19.0 matches expected 119.0.

/var/www/html/tests/Unit/PriceCalculatorTest.php:36

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Survived] Identical
Services/PriceCalculatorService.php:38:9
 
     private function applyCoupon(float $price, Coupon $coupon): float
     {
-        if ($coupon->getType() === 'percent') {
+        if ($coupon->getType() !== 'percent') {
             return $price * (1 - $coupon->getValue() / 100);
         }

[Killed] DecrementInteger
Services/PriceCalculatorService.php:39:13
     private function applyCoupon(float $price, Coupon $coupon): float
     {
         if ($coupon->getType() === 'percent') {
-            return $price * (1 - $coupon->getValue() / 100);
+            return $price * (1 - $coupon->getValue() / 99);
         }
         return max(0, $price - $coupon->getValue());
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithPercentCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithPercentCoupon
Failed asserting that 106.98 matches expected 107.1.

/var/www/html/tests/Unit/PriceCalculatorTest.php:56

FAILURES!
Tests: 2, Assertions: 6, Failures: 1.

[Killed] Multiplication
Services/PriceCalculatorService.php:39:13
     private function applyCoupon(float $price, Coupon $coupon): float
     {
         if ($coupon->getType() === 'percent') {
-            return $price * (1 - $coupon->getValue() / 100);
+            return $price / (1 - $coupon->getValue() / 100);
         }
         return max(0, $price - $coupon->getValue());
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithPercentCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithPercentCoupon
Failed asserting that 132.22 matches expected 107.1.

/var/www/html/tests/Unit/PriceCalculatorTest.php:56

FAILURES!
Tests: 2, Assertions: 6, Failures: 1.

[Killed] Minus
Services/PriceCalculatorService.php:41:9
         if ($coupon->getType() === 'percent') {
             return $price * (1 - $coupon->getValue() / 100);
         }
-        return max(0, $price - $coupon->getValue());
+        return max(0, $price + $coupon->getValue());
     }
 }
killedBy: App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithFixedCoupon
statusReason: 1) App\Tests\Unit\PriceCalculatorTest::testCalculatePriceWithFixedCoupon
Failed asserting that 142.8 matches expected 95.2.

/var/www/html/tests/Unit/PriceCalculatorTest.php:76

FAILURES!
Tests: 3, Assertions: 11, Failures: 1.

[Survived] IncrementInteger
Services/PriceCalculatorService.php:41:9
         if ($coupon->getType() === 'percent') {
             return $price * (1 - $coupon->getValue() / 100);
         }
-        return max(0, $price - $coupon->getValue());
+        return max(1, $price - $coupon->getValue());
     }
 }
