[NoCoverage] PublicVisibility
Services/PurchaseService.php:13:5
     {
     }
 
-    public function purchase(float $price, string $paymentProcessor): bool
+    protected function purchase(float $price, string $paymentProcessor): bool
     {
         $processor = $this->processorFactory->create($paymentProcessor);
