[NoCoverage] InstanceOf_
Validators/SupportedPaymentProcessorValidator.php:18:9
 
     public function validate($value, Constraint $constraint): void
     {
-        if (!$constraint instanceof SupportedPaymentProcessor) {
+        if (!true) {
             throw new UnexpectedTypeException($constraint, SupportedPaymentProcessor::class);
         }

[NoCoverage] LogicalNot
Validators/SupportedPaymentProcessorValidator.php:18:9
 
     public function validate($value, Constraint $constraint): void
     {
-        if (!$constraint instanceof SupportedPaymentProcessor) {
+        if ($constraint instanceof SupportedPaymentProcessor) {
             throw new UnexpectedTypeException($constraint, SupportedPaymentProcessor::class);
         }

[NoCoverage] Throw_
Validators/SupportedPaymentProcessorValidator.php:19:13
     public function validate($value, Constraint $constraint): void
     {
         if (!$constraint instanceof SupportedPaymentProcessor) {
-            throw new UnexpectedTypeException($constraint, SupportedPaymentProcessor::class);
+            new UnexpectedTypeException($constraint, SupportedPaymentProcessor::class);
         }
         if ($value === null || $value === '') {

[NoCoverage] Identical
Validators/SupportedPaymentProcessorValidator.php:21:9
         if (!$constraint instanceof SupportedPaymentProcessor) {
             throw new UnexpectedTypeException($constraint, SupportedPaymentProcessor::class);
         }
-        if ($value === null || $value === '') {
+        if ($value !== null || $value === '') {
             return;
         }

[NoCoverage] Identical
Validators/SupportedPaymentProcessorValidator.php:21:9
         if (!$constraint instanceof SupportedPaymentProcessor) {
             throw new UnexpectedTypeException($constraint, SupportedPaymentProcessor::class);
         }
-        if ($value === null || $value === '') {
+        if ($value === null || $value !== '') {
             return;
         }

[NoCoverage] LogicalNot
Validators/SupportedPaymentProcessorValidator.php:25:9
             return;
         }
         $supportedProcessors = $this->processorFactory->getSupportedProcessors();
-        if (!in_array($value, $supportedProcessors, true)) {
+        if (in_array($value, $supportedProcessors, true)) {
             $this->context->buildViolation($constraint->message)
                 ->setParameter('{{ value }}', $value)

[NoCoverage] MethodCallRemoval
Validators/SupportedPaymentProcessorValidator.php:26:13
         }
         $supportedProcessors = $this->processorFactory->getSupportedProcessors();
         if (!in_array($value, $supportedProcessors, true)) {
-            $this->context->buildViolation($constraint->message)
-                ->setParameter('{{ value }}', $value)
-                ->setParameter('{{ supported }}', implode(', ', $supportedProcessors))
-                ->addViolation();
+            
         }
     }
